JamesLearningResources.org
#+TITLE: Learning Resource for James
#+SETUPFILE: https://fniessen.github.io/org-html-themes/setup/theme-readtheorg.setup
#+STARTUP: showeverything
#+PROPERTY: header-args :eval never-export
#+OPTIONS: toc:nil num:nil

* Machine Learning Resource
** 台大李宏毅
- [[http://speech.ee.ntu.edu.tw/~tlkagk/courses_ML19.html][ML19: 台大機器學習課程大綱]]
- [[https://www.youtube.com/watch?v=CXgbekl66jc][ML Lecture 0-1: Introduction of Machine Learning]]
- [[https://www.youtube.com/watch?v=On1N8u1z2Ng][ML Lecture 0-2: Why we need to learn machine learning?]]
- [[https://www.youtube.com/watch?v=fegAeph9UaA][ML Lecture 1: Regression - Case Study]]
- [[https://www.youtube.com/watch?v=1UqCjFQiiy0][ML Lecture 1: Regression - Demo]]
- [[https://www.youtube.com/watch?v=D_S6y0Jm6dQ][ML Lecture 2: Where does the error come from?]]
- [[https://www.youtube.com/watch?v=yKKNr-QKz2Q][ML Lecture 3-1: Gradient Descent]]
- [[https://www.youtube.com/watch?v=1_HBTJyWgNA][ML Lecture 3-2: Gradient Descent (Demo by AOE)]]
- [[https://www.youtube.com/watch?v=wzPAInDF_gI][ML Lecture 3-3: Gradient Descent (Demo by Minecraft)]]
- [[https://www.youtube.com/watch?v=fZAZUYEeIMg][ML Lecture 4: Classification]]
- [[https://www.youtube.com/watch?v=hSXFuypLukA][ML Lecture 5: Logistic Regression]]
- [[https://www.youtube.com/watch?v=Dr-WRlEFefw][ML Lecture 6: Brief Introduction of Deep Learning]]
- [[https://www.youtube.com/watch?v=ibJpTrp5mcE][ML Lecture 7: Backpropagation]]
- [[https://www.youtube.com/watch?v=gDp2LXGnVLQ&list=PLJV_el3uVTsOK_ZK5L0Iv_EQoL1JefRL4&index=3&t=0s][Anomaly Detection (1/7)]]
- [[https://www.youtube.com/playlist?list=PLJV_el3uVTsOK_ZK5L0Iv_EQoL1JefRL4][Next Step of Machine Learning (Hung-yi Lee, NTU, 2019)]]
- [[https://www.youtube.com/watch?v=Lx3l4lOrquw][ML Lecture 8-1: “Hello world” of deep learning]]
- [[https://www.youtube.com/watch?v=5BJDJd-dzzg][ML Lecture 8-2: Keras 2.0]]
- [[https://www.youtube.com/watch?v=L8unuZNpWw8][ML Lecture 8-3: Keras Demo]]
- [[https://www.youtube.com/watch?v=lnjrn3bF9lA][Explainable ML (1/8)]]
- [[https://www.youtube.com/watch?v=yORbWn7UsBs][Explainable ML (4/8)]]
- [[https://www.youtube.com/watch?v=1xnhQbAV1m0][Explainable ML (5/8)]]
- [[https://www.youtube.com/watch?v=xki61j7z-30][ML Lecture 9-1: Tips for Training DNN]]
- [[https://www.youtube.com/watch?v=Ky1ku1miDow][ML Lecture 9-2: Keras Demo 2]]
- [[https://www.youtube.com/watch?v=F1vek6ULo9w][ML Lecture 9-3: Fizz Buzz in Tensorflow (sequel)]]
- [[https://www.youtube.com/watch?v=FrKWiRv254g][ML Lecture 10: Convolutional Neural Network]]
- [[https://www.youtube.com/watch?v=XsC9byQkUH8][ML Lecture 11: Why Deep?]]
- [[https://www.youtube.com/watch?v=fX_guE7JNnY][ML Lecture 12: Semi-supervised]]
- [[https://www.youtube.com/watch?v=iwh5o_M4BNU][ML Lecture 13: Unsupervised Learning - Linear Methods]]
- [[https://www.youtube.com/watch?v=X7PH3NuYW0Q][ML Lecture 14: Unsupervised Learning - Word Embedding]]
- [[https://www.youtube.com/watch?v=GBUEjkpoxXc][ML Lecture 15: Unsupervised Learning - Neighbor Embedding]]
- [[https://www.youtube.com/watch?v=yyKaACh_j3M&list=PLJV_el3uVTsOK_ZK5L0Iv_EQoL1JefRL4&index=45&t=0s][Meta Learning – Metric-based (1/3)]]
- [[https://www.youtube.com/watch?v=Tk5B4seA-AU][ML Lecture 16: Unsupervised Learning - Auto-encoder]]
- [[https://www.youtube.com/watch?v=YNUek8ioAJk][ML Lecture 17: Unsupervised Learning - Deep Generative Model (Part I)]]
- [[https://www.youtube.com/watch?v=8zomhgKrsmQ][ML Lecture 18: Unsupervised Learning - Deep Generative Model (Part II)]]
- [[https://www.youtube.com/watch?v=6ZWu4L7XOiQ&list=PLJV_el3uVTsOK_ZK5L0Iv_EQoL1JefRL4&index=48&t=0s][More about Auto-encoder (1/4)]]
- [[https://www.youtube.com/watch?v=qD6iD4TFsdQ][ML Lecture 19: Transfer Learning]]
- [[https://www.youtube.com/watch?v=7qT5P9KJnWo&list=PLJV_el3uVTsOK_ZK5L0Iv_EQoL1JefRL4&index=25][Life Long Learning (1/7)]]
- [[https://www.youtube.com/watch?v=ZjfjPzXw6og&feature=youtu.be][Sequence-to-sequence Learning]]
- [[https://www.youtube.com/watch?v=EkAqYbpCYAc&list=PLJV_el3uVTsOK_ZK5L0Iv_EQoL1JefRL4&index=33&t=0s][Meta Learning – MAML (1/9)]]
- [[https://www.youtube.com/watch?v=QSEPStBgwRQ][ML Lecture 20: Support Vector Machine (SVM)]]
- [[https://www.youtube.com/watch?v=xCGidAeyS4M][ML Lecture 21-1: Recurrent Neural Network (Part I)]]
- [[https://www.youtube.com/watch?v=rTqmWlnwz_0][ML Lecture 21-2: Recurrent Neural Network (Part II)]]
- [[https://www.youtube.com/watch?v=YIuBHB9Ejok&feature=youtu.be][Unsupervised Syntactic Parsing (ft. 莊永松同學)]]
- [[https://www.youtube.com/watch?v=tH9FH1DH5n0][ML Lecture 22: Ensemble]]
- [[https://www.youtube.com/watch?v=W8XF3ME8G2I][ML Lecture 23-1: Deep Reinforcement Learning]]
- [[https://www.youtube.com/watch?v=y8UPGr36ccI][ML Lecture 23-2: Policy Gradient (Supplementary Explanation)]]
- [[https://www.youtube.com/watch?v=2-JNBzCq77c][ML Lecture 23-3: Reinforcement Learning (including Q-learning)]]
- [[https://www.youtube.com/playlist?list=PLJV_el3uVTsODxQFgzMzPLa16h6B8kWM_][Deep Reinforcement Learning, 2018]]
- [[https://www.youtube.com/watch?v=dPp8rCAnU_A&list=PLJV_el3uVTsOK_ZK5L0Iv_EQoL1JefRL4&index=52&t=0s][Network Compression (1/6)]]
- [[https://www.youtube.com/watch?v=ufcKFjdpT98&list=PLJV_el3uVTsOK_ZK5L0Iv_EQoL1JefRL4&index=58&t=0s][GAN (Quick Review)]]
- [[https://www.youtube.com/playlist?list=PLJV_el3uVTsMq6JEFPW35BCiOQTsoqwNw][Generative Adversarial Network (GAN), 2018]]
- [[https://www.youtube.com/watch?v=ugWDIIOHtPA&list=PLJV_el3uVTsOK_ZK5L0Iv_EQoL1JefRL4&index=58][Transformer]]
- [[https://www.youtube.com/watch?v=UYPa347-DdE&list=PLJV_el3uVTsOK_ZK5L0Iv_EQoL1JefRL4&index=62&t=0s][ELMO, BERT, GPT]]
- [[https://www.youtube.com/watch?v=uXY18nzdSsM&list=PLJV_el3uVTsOK_ZK5L0Iv_EQoL1JefRL4&index=59][Flow-based Generative Model]]
- [[https://brohrer.mcknote.com/zh-Hant/statistics/how_bayesian_inference_works.html][貝葉斯推斷的運作原理]]
